app/controllers/peticion/peticion_tis_controller.rb

SELECT [peticion_servicio_tis].* FROM [peticion_servicio_tis] INNER JOIN [peticion_peticion_servicio_tis] ON [peticion_peticion_servicio_tis].[servicio_id] = [peticion_servicio_tis].[id] WHERE (peticion_peticion_servicio_tis.peticion_id=1)
---
  def edit
    @peticion_peticion_ti = Peticion::PeticionTi.find(params[:id])
    @peticion_servicio_tis = Peticion::ServicioTi.joins(:peticiones).where("peticion_peticion_servicio_tis.peticion_id=?",@peticion_peticion_ti.id)